Importar librerias

In [2]:
import pandas as pd

Abrir archivo csv

In [3]:
data = pd.read_csv('/Users/nandoramirez/Downloads/MoneyControl_2025-08-29_Trabajado.csv')

Inspección inicial data

In [4]:
data.head()

,FECHA,TIPO,CANTIDAD,CATEGORÍA,CUENTA,NOTA,CANTIDAD_2
0,31/07/18,Transferencia,"1.095.997,00",NaN,Ingreso de efectivo,Pago doble Citibank,"1.095.997,00"
1,1/08/18,Gastos,"-15.000,00",Uber,Efectivo,EBAG,"15.000,00"
2,1/08/18,Gastos,"-10.000,00",Celular,Efectivo,Recarga Nando,"10.000,00"
3,1/08/18,Gastos,"-211.000,00",Compra Saldo Conexión +,Efectivo,NaN,"211.000,00"
4,1/08/18,Ingresos,"20.006,09",Venta Recargas,Cuenta bancaria,Recarga Juan Laneros,"20.006,09"

Ver tipo de variables del dataframte

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12131 entries, 0 to 12130
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   FECHA       12131 non-null  object
 1   TIPO        12131 non-null  object
 2   CANTIDAD    12131 non-null  object
 3   CATEGORÍA   10413 non-null  object
 4   CUENTA      12131 non-null  object
 5   NOTA        8847 non-null   object
 6   CANTIDAD_2  12131 non-null  object
dtypes: object(7)
memory usage: 663.5+ KB

Comprobar duplicados

In [6]:
data.nunique()

FECHA         2327
TIPO             3
CANTIDAD      3104
CATEGORÍA       84
CUENTA          83
NOTA          3737
CANTIDAD_2    2781
dtype: int64

Cálculo de valores faltantes

In [7]:
data.isnull().sum()

FECHA            0
TIPO             0
CANTIDAD         0
CATEGORÍA     1718
CUENTA           0
NOTA          3284
CANTIDAD_2       0
dtype: int64

Calcular el porcentaje de valores faltantes en cada columna

In [8]:
(data.isnull().sum()/(len(data)))*100

FECHA          0.000000
TIPO           0.000000
CANTIDAD       0.000000
CATEGORÍA     14.162064
CUENTA         0.000000
NOTA          27.071140
CANTIDAD_2     0.000000
dtype: float64

Conocer los valores faltantes de la columna Categoria

In [10]:
print(data.CATEGORÍA.isnull())

0         True
1        False
2        False
3        False
4        False
         ...
12126    False
12127    False
12128    False
12129    False
12130    False
Name: CATEGORÍA, Length: 12131, dtype: bool

Crear un nuevo dataframe con los valores faltantes en la columna CATEGORIA

In [11]:
faltantes_categoria = data[data['CATEGORÍA'].isnull()]
faltantes_categoria.head()

,FECHA,TIPO,CANTIDAD,CATEGORÍA,CUENTA,NOTA,CANTIDAD_2
0,31/07/18,Transferencia,"1.095.997,00",NaN,Ingreso de efectivo,Pago doble Citibank,"1.095.997,00"
9,2/08/18,Gastos,"-17.000,00",NaN,Efectivo,Ecografía ocular Camila,"17.000,00"
16,3/08/18,Transferencia,"48.477,79",NaN,Cuenta bancaria,NaN,"48.477,79"
17,3/08/18,Transferencia,"307.522,21",NaN,Ingreso de efectivo,Ajuste por reinicio app,"307.522,21"
36,6/08/18,Transferencia,"3.000,00",NaN,Efectivo,NaN,"3.000,00"

Consultar todos los valores del nuevo dataframe donde TIPO sea diferente de 'Transferencia'

In [12]:
faltantes_categoria[faltantes_categoria['TIPO'] != 'Transferencia']

,FECHA,TIPO,CANTIDAD,CATEGORÍA,CUENTA,NOTA,CANTIDAD_2
9,2/08/18,Gastos,"-17.000,00",NaN,Efectivo,Ecografía ocular Camila,"17.000,00"
3896,1/08/20,Gastos,"-4.000,00",NaN,Efectivo,Roscones y gomitas,"4.000,00"
5553,12/06/21,Gastos,"-32.000,00",NaN,Efectivo,Salida con Cris,"32.000,00"
5622,27/06/21,Gastos,"-82.000,00",NaN,Efectivo,"Juegos, comida, paleta Camila","82.000,00"
5623,27/06/21,Gastos,"-29.000,00",NaN,Efectivo,Transporte y cívica,"29.000,00"
6308,14/11/21,Gastos,"-14.000,00",NaN,Efectivo,TTE a donde Fabián,"14.000,00"
6737,1/02/22,Gastos,"-143.000,00",NaN,Cuenta bancaria,NaN,"143.000,00"
6842,17/02/22,Gastos,"-70.000,00",NaN,Cuenta bancaria,Soportes portátil,"70.000,00"
7019,1/04/22,Gastos,"-456.972,70",NaN,Cuenta bancaria,Faltante,"456.972,70"
7129,30/04/22,Gastos,"-8.000,00",NaN,Efectivo,Desayuno,"8.000,00"
7389,16/07/22,Gastos,"-34.000,00",NaN,Efectivo,Ensaladas frutas,"34.000,00"
7405,22/07/22,Gastos,"-15.000,00",NaN,Efectivo,Wafle,"15.000,00"
7487,12/08/22,Gastos,"-430,05",NaN,Cuenta bancaria,NaN,"430,05"
7583,8/09/22,Gastos,"-10.000,00",NaN,Cuenta bancaria,Papitas ITM,"10.000,00"
7677,1/10/22,Gastos,"-9.000,00",NaN,Efectivo,Paletas y Takis,"9.000,00"
7692,8/10/22,Gastos,"-7.000,00",NaN,Efectivo,Perro y barquillo,"7.000,00"
8178,11/02/23,Gastos,"-4.000,00",NaN,Efectivo,Arbitraje Juan,"4.000,00"
8371,21/03/23,Gastos,"-30.000,00",NaN,Efectivo,Transporte cicla spinning,"30.000,00"
8478,15/04/23,Gastos,"-20.000,00",NaN,Efectivo,Arena y cuido gatos,"20.000,00"
9556,31/01/24,Gastos,"-314.300,00",NaN,Cuenta bancaria,Vans Ultrarange,"314.300,00"
9979,7/06/24,Gastos,"-14.000,00",NaN,Efectivo,Panadería,"14.000,00"